RTP/src/BusinessProcesses/ПредоставлениеУслугУдаленногоТестирования/ПредоставлениеУслугУдаленногоТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПредоставлениеУслугУдаленногоТестирования</name>
  <basedOn>Document.ОформлениеЗаказа</basedOn>
  <task>Task.ЗадачаБП</task>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Тестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленныйТестировщик</name>
    <type>
      <types>CatalogRef.УдаленныеТестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УтверждениеЧекЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТестирования</name>
    <type>
      <types>EnumRef.ВидыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

RTP/src/Enums/ТипыПользователей/ТипыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПользователей</name>
  <enumValues>
    <name>Тестировщик</name>
  </enumValues>
  <enumValues>
    <name>УдаленныйТестировщик</name>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
  <enumValues>
    <name>Менеджер</name>
  </enumValues>
</mdclass:Enum>

RTP/src/Enums/СтатусыЗадачи/СтатусыЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадачи</name>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Закрытый</name>
  </enumValues>
</mdclass:Enum>

RTP/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>EnumRef.ТипыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/BusinessProcesses/ПредоставлениеУслугУдаленногоТестирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаказаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура СогласованиеУсловийПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура СогласованиеСКлиентомПроверкаУсловия(ТочкаМаршрута, Результат)	
	Результат = СогласованиеЗаказа;
КонецПроцедуры

Процедура СоставлениеЧекЛистаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Тестировщик);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ТестированиеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.УдаленныйТестировщик);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПодготовкаОтчётаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Тестировщик);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗавершитьРасчётСЗаказчикомПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПроизвестиРасчётУТПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗакрытьЗаказПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		УстановитьПользователя(Задача, Перечисления.ТипыПользователей.Менеджер);
		УстановитьСтатусЗадачи(Задача, Перечисления.СтатусыЗадачи.Открытый);
		ЗадатьУникальноеНазвание(Задача);
		Записать();
	КонецЦикла;
КонецПроцедуры


Процедура УстановитьПользователя(Задача, ТипПользователя)
	УИдентификатор = Неопределено;
	
	Если ТипПользователя = Перечисления.ТипыПользователей.Менеджер Тогда 
		УИдентификатор = ЭтотОбъект.Менеджер.Пользователь;
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда 
		УИдентификатор = ЭтотОбъект.Тестировщик.Пользователь;
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда 
		УИдентификатор = ЭтотОбъект.УдаленныйТестировщик.Пользователь;
	КонецЕсли;
	
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор", УИдентификатор);
	Задача.Исполнитель = Пользователь;
КонецПроцедуры

Процедура УстановитьСтатусЗадачи(Задача, Статус)
	Задача.Статус = Статус;
КонецПроцедуры

Процедура ЗадатьУникальноеНазвание(Задача)
	СвязанныйЗаказ = Справочники.Заказы.НайтиПоРеквизиту("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Задача.Наименование = Задача.Наименование + " " + СвязанныйЗаказ.Название;
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("en = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
